In [6]:
import pandas as pd
import numpy as np

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer       # for missing data
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import MinMaxScaler
from sklearn.tree import DecisionTreeClassifier

In [8]:
df = pd.read_csv("C:\\ML and DL\\learning_pipelines\\Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df.drop(columns=['PassengerId', 'Name','Ticket','Cabin'],inplace=True)

In [10]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [12]:
X_train, X_test, y_train, y_test = train_test_split(df.drop(columns=['Survived']), df.Survived, test_size=0.2, random_state=42)

In [14]:
X_train.head(), y_train.head()

(     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
 331       1    male  45.5      0      0  28.5000        S
 733       2    male  23.0      0      0  13.0000        S
 382       3    male  32.0      0      0   7.9250        S
 704       3    male  26.0      1      0   7.8542        S
 813       3  female   6.0      4      2  31.2750        S,
 331    0
 733    0
 382    0
 704    0
 813    0
 Name: Survived, dtype: int64)

In [17]:
# checking missing values
df.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [22]:
# using SimpleImputer
age = SimpleImputer()   # default is mean so the missing values will be replaced by mean
embarked = SimpleImputer(strategy='most_frequent')

X_train_age = age.fit_transform(X_train[['Age']])
X_train_embarked = embarked.fit_transform(X_train[['Embarked']])

X_test_age = age.transform(X_test[['Age']])
X_test_embarked = embarked.transform(X_test[['Embarked']])

In [25]:
# changing categorical values to numerical values using OneHotEncoder

sex = OneHotEncoder( handle_unknown='ignore')
embarked_OHE = OneHotEncoder(handle_unknown='ignore')

x_train_sex = sex.fit_transform(X_train[['Sex']])
x_train_embarked_OHE = embarked_OHE.fit_transform(X_train[['Embarked']])

x_test_sex = sex.transform(X_test[['Sex']])
x_test_embarked_OHE = embarked_OHE.transform(X_test[['Embarked']])